src/tree-library.org
#+TITLE: Building Interactive Experiment involving Binary Search Trees - API Documentation
#+AUTHOR: Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team)




#+SETUPFILE: ./org-templates/level-0.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil

* Binary Nodes
  A Binary Node are defined as a node consisting of a *triplet*:<Data,Left-child,Right-Child>. A binary node forms the fundamental unit of all Binary Trees.
In the JavaScript implementation, a Binary Node is defined as a class which could be used to create Binary Trees of various kinds. The following code snippet shows the definition of the /BinaryNode/ class. Two methods - /IsNode()/ and /UpdateKey()/ are defined as members of this class which check for a valid node and update data in a given node respectively

#+NAME: Binary_Node_Class
#+BEGIN_SRC js

class BinaryNode {
  constructor(data = null, left_child = null, right_child = null) {
    this.data = data;
    this.left = left_child;
    this.right = right_child;

  }
  IsNode() {
    if (this.data === null && this.left_child === null && this.right_child === null)
      return true;
    else if (this.data != null)
      return true;
    else
      return false;
  }
  UpdateKey(data, new_data) {
    if (this.data === data)
      this.data = new_data;
  }
}


#+END_SRC
* Binary Trees 
  A Binary Tree is a data structure that contains *Binary Nodes*.

