build/docs/tree-library.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-11 Sun 22:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Interactive Experiment involving Binary Search Trees - API Documentation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./style/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Building Interactive Experiment involving Binary Search Trees - API Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcbdde41">1. Binary Nodes</a></li>
<li><a href="#org04ac1d8">2. Binary Trees</a>
<ul>
<li><a href="#org03ab650">2.1. Binary Tree Class</a>
<ul>
<li><a href="#org5dc977c">2.1.1. CreateNode(Value):</a></li>
<li><a href="#org54200b0">2.1.2. Insert(Value):</a></li>
<li><a href="#org3d07f01">2.1.3. BuildTree(nodelist)</a></li>
<li><a href="#org514aef5">2.1.4. GetRootNode():</a></li>
<li><a href="#org4700ca9">2.1.5. Size():</a></li>
<li><a href="#org842fa13">2.1.6. Height():</a></li>
<li><a href="#org091ae1f">2.1.7. Level():</a></li>
<li><a href="#org6d915d3">2.1.8. Search(Root,Key):</a></li>
<li><a href="#org5bd29c3">2.1.9. Erase():</a></li>
<li><a href="#orgaa5b6ba">2.1.10. CopyTree():</a></li>
<li><a href="#org23d1f08">2.1.11. InOrder():</a></li>
<li><a href="#org35fe8fe">2.1.12. PreOrder():</a></li>
<li><a href="#orgf731cfb">2.1.13. PostOrder():</a></li>
</ul>
</li>
<li><a href="#orgfb585ab">2.2. Binary Search Tree Class</a>
<ul>
<li><a href="#orgaab19e7">2.2.1. Insert(Value):</a></li>
<li><a href="#org5ae6fac">2.2.2. BuildTree(Nodelist):</a></li>
<li><a href="#org1053c8d">2.2.3. Remove(Value):</a></li>
<li><a href="#org278fa82">2.2.4. CopyTree(node):</a></li>
<li><a href="#org36c4979">2.2.5. Search(Value):</a></li>
<li><a href="#org2f99dd8">2.2.6. FindMinimum():</a></li>
<li><a href="#org786e42b">2.2.7. RightSubtree():</a></li>
<li><a href="#org8e1fa65">2.2.8. LeftSubtree():</a></li>
<li><a href="#org68529ae">2.2.9. GenerateState():</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgab0641f">3. Tangle</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcbdde41" class="outline-2">
<h2 id="orgcbdde41"><span class="section-number-2">1</span> Binary Nodes</h2>
<div class="outline-text-2" id="text-1">
<p>
  A Binary Node are defined as a node consisting of a <b>triplet</b>:&lt;Data,Left-child,Right-Child&gt;. A binary node forms the fundamental unit of all Binary Trees.
In the JavaScript implementation, a Binary Node is defined as a class which could be used to create Binary Trees of various kinds. The following code snippet shows the definition of the <i>BinaryNode</i> class. Two methods - <i>IsNode()</i> and <i>UpdateKey()</i> are defined as members of this class which check for a valid node and update data in a given node respectively
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgb17f3c5">
<span style="font-weight: bold;">class</span> BinaryNode {
  constructor(data = <span style="font-weight: bold; text-decoration: underline;">null</span>, left_child = <span style="font-weight: bold; text-decoration: underline;">null</span>, right_child = <span style="font-weight: bold; text-decoration: underline;">null</span>) {
    <span style="font-weight: bold; text-decoration: underline;">this</span>.data = data;
    <span style="font-weight: bold; text-decoration: underline;">this</span>.left = left_child;
    <span style="font-weight: bold; text-decoration: underline;">this</span>.right = right_child;

  }
  IsNode() {
    <span style="font-weight: bold;">if</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.data === <span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; <span style="font-weight: bold; text-decoration: underline;">this</span>.left_child === <span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; <span style="font-weight: bold; text-decoration: underline;">this</span>.right_child === <span style="font-weight: bold; text-decoration: underline;">null</span>)
      <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">true</span>;
    <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.data != <span style="font-weight: bold; text-decoration: underline;">null</span>)
      <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">true</span>;
    <span style="font-weight: bold;">else</span>
      <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">false</span>;
  }
  UpdateKey(data, new_data) {
    <span style="font-weight: bold;">if</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.data === data)
      <span style="font-weight: bold; text-decoration: underline;">this</span>.data = new_data;
  }
}


</pre>
</div>
</div>
</div>
<div id="outline-container-org04ac1d8" class="outline-2">
<h2 id="org04ac1d8"><span class="section-number-2">2</span> Binary Trees</h2>
<div class="outline-text-2" id="text-2">
<p>
A Binary Tree is a data structure that contains <b>Binary Nodes</b>.
</p>
</div>
