src/tree-library.org
** Binary Tree Class
   The /BinaryTree/ class forms the base class from which various binary trees (like Binary Search Trees and AVL Trees) inherit their properties. The class definition and the various methods that this API provides are listed below:

#+NAME: Binary_Tree_Class
#+BEGIN_SRC js

  class BinaryTree {

      constructor() {
          this.root = null;
          this.animationState = []

      }

      CopyTree(node = this.root) {
          var CloneTree = function(Root) {
              if (Root == null)
                  return null;
              //create new node and make it a copy of node pointed by Root
              var NewNode = new BinaryNode();
              NewNode.data = Root.data; //copying data
              NewNode.left = CloneTree(Root.left); //cloning left child
              NewNode.right = CloneTree(Root.right); //cloning right child
              return NewNode;
          }
          var newTree = CloneTree(node);
          return newTree;
      }

      CreateNode(Key) {
          var NewNode = new BinaryNode(Key);
          return NewNode;
      }

      Insert(Value) {
          var NewNode = this.CreateNode(Value);

          function InsertNode(Root, newNode) {
              var Queue = [];
              Queue.push(Root); //push the root
              while (true) {
                  var node = Queue.pop();
                  if (node.left === null) {
                      node.left = newNode;
                      return;
                  } else {
                      Queue.unshift(node.left)
                  }

                  if (node.right === null) {
                      node.right = newNode;
                      return;
                  } else {
                      Queue.unshift(node.right)
                  }
              }
          }
          if (this.root === null)
              this.root = NewNode;
          else
              InsertNode(this.root, NewNode);
          return this;
      }

      BuildTree(NodeList = null) {
          for (let node in NodeList) {
              this.Insert(NodeList[node]);
          }
          return this;
      }

      GetRootNode() {
          return this.root;
      }

      Size() {
          var CalSize = function(Root) {
              if (Root != null) {
                  return 1 + CalSize(Root.left) + CalSize(Root.right);
              } else {
                  return 0;
              }
          }
          var size = CalSize(this.root);
          return size;
      }

      GenerateState() {
          var stater;

          if (this.root == null) {
              console.log("Root is NULL")
              return null;
          }

          function gen(root, starter) {

              if (root.left != null || root.right != null) {
                  starter.children = []

                  if (root.left != null) {

                      starter.children.push({
                          data: root.left.data
                      })
                      gen(root.left, starter.children[0])
                  }
                  if (root.right != null) {

                      starter.children.push({
                          data: root.right.data
                      })
                      if (starter.children.length > 1) {

                          gen(root.right, starter.children[1])

                      } else {
                          gen(root.right, starter.children[0])

                      }
                  }
              }
          }
          stater = {
              data: this.root.data,
              children: []
          };
          gen(this.root, stater)
          return stater
      }


      InOrder() {
          this.animationState = []
          var context = this;

          function Inorderhelper(Root, node_list) {

              if (Root !== null) {
                  let list = [context.GenerateState(), Root.data, "", "black"]
                  context.animationState.push(list)
                  if (Root.left != null) {
                      Inorderhelper(Root.left, node_list);
                  }
                  // console.log(Root.data); // Need to save states here

                  list = [context.GenerateState(), Root.data, " " + Root.data + " ", "red"]
                  context.animationState.push(list)
                  node_list.push(Root.data);
                  if (Root.right != null) {
                      Inorderhelper(Root.right, node_list);


                      list = [context.GenerateState(), Root.data, "", "black"]
                      context.animationState.push(list)
                  }
                  // return node_list;
              }
          }
          var node_list = [];
          let list = [context.GenerateState(), -999, "In Order : [ ", "black"]
          context.animationState.push(list)
          Inorderhelper(this.root, node_list)

          list = [context.GenerateState(), -999, " ] ", "black"]
          context.animationState.push(list)

          return node_list;
          // console.log(node_list);
      }

      PreOrder() {
          this.animationState = []
          var context = this

          function PreOrderhelper(Root, node_list) {
              if (Root != null) {
                  let list = [context.GenerateState(), Root.data, " " + Root.data + " ", "red"]
                  context.animationState.push(list)
                  node_list.push(Root.data);
                  if (Root.left != null) {
                      PreOrderhelper(Root.left, node_list);
                      list = [context.GenerateState(), Root.data, "", "black"]
                      context.animationState.push(list)
                  }
                  if (Root.right != null) {
                      PreOrderhelper(Root.right, node_list);
                      list = [context.GenerateState(), Root.data, "", "black"]
                      context.animationState.push(list)
                  }
              }
          }
          var node_list = [];

          let list = [context.GenerateState(), -999, "Pre Order : [ ", "black"]
          context.animationState.push(list)
          PreOrderhelper(this.root, node_list);
          list = [context.GenerateState(), -999, " ] ", "black"]
          context.animationState.push(list)
          return node_list;

      }

      PostOrder() {
          this.animationState = []
          var context = this

          function PostOrderhelper(Root, node_list) {
              if (Root != null) {
                  let list = [context.GenerateState(), Root.data, "", "black"]
                  context.animationState.push(list)
                  if (Root.left != null) {
                      PostOrderhelper(Root.left, node_list);
                      list = [context.GenerateState(), Root.data, "", "black"]
                      context.animationState.push(list)
                  }
                  if (Root.right != null) {
                      PostOrderhelper(Root.right, node_list);
                  }
                  list = [context.GenerateState(), Root.data, " " + Root.data + " ", "red"]
                  context.animationState.push(list)

                  node_list.push(Root.data);
              }
          }
          var node_list = [];
          let list = [context.GenerateState(), -999, "Post Order : [ ", "black"]
          context.animationState.push(list)
          PostOrderhelper(this.root, node_list);
          list = [context.GenerateState(), -999, " ] ", "black"]
          context.animationState.push(list)
          // console.log(node_list);
          return node_list;
      }


      Erase() {
          this.root = null;
          return null;
      }


      Height() {
          var HeightWithRoot = function(Root) {
              if (Root == null)
                  return 0;
              let lHeight = HeightWithRoot(Root.left);
              let rHeight = HeightWithRoot(Root.right);
              if (lHeight > rHeight)
                  return 1 + lHeight;
              return 1 + rHeight;
          }
          var height = HeightWithRoot(this.root);
          return height;
      }



      Level() {
          var LevelWithRoot = function(Root) {
              if (Root == null)
                  return 0;
              var lHeight = LevelWithRoot(Root.left);
              var rHeight = LevelWithRoot(Root.right);
              if (lHeight > rHeight)
                  return 1 + lHeight;
              return 1 + rHeight;
          }
          var level = LevelWithRoot(this.root);
          return level;
      }

      Search(Root, Key) {
          if (Root === null)
              return null;
          if (Key == Root.data)
              return Root;
          return (this.Search(Root.left, Key) || this.Search(Root.right, Key));
      }


  };

#+END_SRC
The details of the various methods defined in the /BinaryTree/ class are as follows:

