build/docs/tree-library.html

<div id="outline-container-org03ab650" class="outline-3">
<h3 id="org03ab650"><span class="section-number-3">2.1</span> Binary Tree Class</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The <i>BinaryTree</i> class forms the base class from which various binary trees (like Binary Search Trees and AVL Trees) inherit their properties. The class definition and the various methods that this API provides are listed below:
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgfc3c002">
  <span style="font-weight: bold;">class</span> BinaryTree {

      constructor() {
          <span style="font-weight: bold; text-decoration: underline;">this</span>.root = <span style="font-weight: bold; text-decoration: underline;">null</span>;
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animationState = []

      }

      CopyTree(node = <span style="font-weight: bold; text-decoration: underline;">this</span>.root) {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">CloneTree</span> = <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">Root</span>) {
              <span style="font-weight: bold;">if</span> (Root == <span style="font-weight: bold; text-decoration: underline;">null</span>)
                  <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">null</span>;
              <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">create new node and make it a copy of node pointed by Root</span>
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">NewNode</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BinaryNode</span>();
              NewNode.data = Root.data; <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">copying data</span>
              NewNode.left = CloneTree(Root.left); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">cloning left child</span>
              NewNode.right = CloneTree(Root.right); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">cloning right child</span>
              <span style="font-weight: bold;">return</span> NewNode;
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">newTree</span> = CloneTree(node);
          <span style="font-weight: bold;">return</span> newTree;
      }

      CreateNode(Key) {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">NewNode</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BinaryNode</span>(Key);
          <span style="font-weight: bold;">return</span> NewNode;
      }

      Insert(Value) {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">NewNode</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>.CreateNode(Value);

          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">InsertNode</span>(<span style="font-weight: bold; font-style: italic;">Root</span>, <span style="font-weight: bold; font-style: italic;">newNode</span>) {
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">Queue</span> = [];
              Queue.push(Root); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">push the root</span>
              <span style="font-weight: bold;">while</span> (<span style="font-weight: bold; text-decoration: underline;">true</span>) {
                  <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span> = Queue.pop();
                  <span style="font-weight: bold;">if</span> (node.left === <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      node.left = newNode;
                      <span style="font-weight: bold;">return</span>;
                  } <span style="font-weight: bold;">else</span> {
                      Queue.unshift(node.left)
                  }

                  <span style="font-weight: bold;">if</span> (node.right === <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      node.right = newNode;
                      <span style="font-weight: bold;">return</span>;
                  } <span style="font-weight: bold;">else</span> {
                      Queue.unshift(node.right)
                  }
              }
          }
          <span style="font-weight: bold;">if</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.root === <span style="font-weight: bold; text-decoration: underline;">null</span>)
              <span style="font-weight: bold; text-decoration: underline;">this</span>.root = NewNode;
          <span style="font-weight: bold;">else</span>
              InsertNode(<span style="font-weight: bold; text-decoration: underline;">this</span>.root, NewNode);
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>;
      }

      BuildTree(NodeList = <span style="font-weight: bold; text-decoration: underline;">null</span>) {
          <span style="font-weight: bold;">for</span> (<span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">node</span> <span style="font-weight: bold;">in</span> NodeList) {
              <span style="font-weight: bold; text-decoration: underline;">this</span>.Insert(NodeList[node]);
          }
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>;
      }

      GetRootNode() {
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.root;
      }

      Size() {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">CalSize</span> = <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">Root</span>) {
              <span style="font-weight: bold;">if</span> (Root != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                  <span style="font-weight: bold;">return</span> 1 + CalSize(Root.left) + CalSize(Root.right);
              } <span style="font-weight: bold;">else</span> {
                  <span style="font-weight: bold;">return</span> 0;
              }
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">size</span> = CalSize(<span style="font-weight: bold; text-decoration: underline;">this</span>.root);
          <span style="font-weight: bold;">return</span> size;
      }

      GenerateState() {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">stater</span>;

          <span style="font-weight: bold;">if</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.root == <span style="font-weight: bold; text-decoration: underline;">null</span>) {
              console.log(<span style="font-style: italic;">"Root is NULL"</span>)
              <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">null</span>;
          }

          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">gen</span>(<span style="font-weight: bold; font-style: italic;">root</span>, <span style="font-weight: bold; font-style: italic;">starter</span>) {

              <span style="font-weight: bold;">if</span> (root.left != <span style="font-weight: bold; text-decoration: underline;">null</span> || root.right != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                  starter.children = []

                  <span style="font-weight: bold;">if</span> (root.left != <span style="font-weight: bold; text-decoration: underline;">null</span>) {

                      starter.children.push({
                          data: root.left.data
                      })
                      gen(root.left, starter.children[0])
                  }
                  <span style="font-weight: bold;">if</span> (root.right != <span style="font-weight: bold; text-decoration: underline;">null</span>) {

                      starter.children.push({
                          data: root.right.data
                      })
                      <span style="font-weight: bold;">if</span> (starter.children.length &gt; 1) {

                          gen(root.right, starter.children[1])

                      } <span style="font-weight: bold;">else</span> {
                          gen(root.right, starter.children[0])

                      }
                  }
              }
          }
          stater = {
              data: <span style="font-weight: bold; text-decoration: underline;">this</span>.root.data,
              children: []
          };
          gen(<span style="font-weight: bold; text-decoration: underline;">this</span>.root, stater)
          <span style="font-weight: bold;">return</span> stater
      }


      InOrder() {
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animationState = []
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">context</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>;

          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">Inorderhelper</span>(<span style="font-weight: bold; font-style: italic;">Root</span>, <span style="font-weight: bold; font-style: italic;">node_list</span>) {

              <span style="font-weight: bold;">if</span> (Root !== <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                  <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                  context.animationState.push(list)
                  <span style="font-weight: bold;">if</span> (Root.left != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      Inorderhelper(Root.left, node_list);
                  }
                  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">console.log(Root.data); // Need to save states here</span>

                  list = [context.GenerateState(), Root.data, <span style="font-style: italic;">" "</span> + Root.data + <span style="font-style: italic;">" "</span>, <span style="font-style: italic;">"red"</span>]
                  context.animationState.push(list)
                  node_list.push(Root.data);
                  <span style="font-weight: bold;">if</span> (Root.right != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      Inorderhelper(Root.right, node_list);


                      list = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                      context.animationState.push(list)
                  }
                  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">return node_list;</span>
              }
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node_list</span> = [];
          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), -999, <span style="font-style: italic;">"In Order : [ "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)
          Inorderhelper(<span style="font-weight: bold; text-decoration: underline;">this</span>.root, node_list)

          list = [context.GenerateState(), -999, <span style="font-style: italic;">" ] "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)

          <span style="font-weight: bold;">return</span> node_list;
          <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">console.log(node_list);</span>
      }

      PreOrder() {
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animationState = []
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">context</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>

          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">PreOrderhelper</span>(<span style="font-weight: bold; font-style: italic;">Root</span>, <span style="font-weight: bold; font-style: italic;">node_list</span>) {
              <span style="font-weight: bold;">if</span> (Root != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                  <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), Root.data, <span style="font-style: italic;">" "</span> + Root.data + <span style="font-style: italic;">" "</span>, <span style="font-style: italic;">"red"</span>]
                  context.animationState.push(list)
                  node_list.push(Root.data);
                  <span style="font-weight: bold;">if</span> (Root.left != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      PreOrderhelper(Root.left, node_list);
                      list = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                      context.animationState.push(list)
                  }
                  <span style="font-weight: bold;">if</span> (Root.right != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      PreOrderhelper(Root.right, node_list);
                      list = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                      context.animationState.push(list)
                  }
              }
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node_list</span> = [];

          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), -999, <span style="font-style: italic;">"Pre Order : [ "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)
          PreOrderhelper(<span style="font-weight: bold; text-decoration: underline;">this</span>.root, node_list);
          list = [context.GenerateState(), -999, <span style="font-style: italic;">" ] "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)
          <span style="font-weight: bold;">return</span> node_list;

      }

      PostOrder() {
          <span style="font-weight: bold; text-decoration: underline;">this</span>.animationState = []
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">context</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>

          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">PostOrderhelper</span>(<span style="font-weight: bold; font-style: italic;">Root</span>, <span style="font-weight: bold; font-style: italic;">node_list</span>) {
              <span style="font-weight: bold;">if</span> (Root != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                  <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                  context.animationState.push(list)
                  <span style="font-weight: bold;">if</span> (Root.left != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      PostOrderhelper(Root.left, node_list);
                      list = [context.GenerateState(), Root.data, <span style="font-style: italic;">""</span>, <span style="font-style: italic;">"black"</span>]
                      context.animationState.push(list)
                  }
                  <span style="font-weight: bold;">if</span> (Root.right != <span style="font-weight: bold; text-decoration: underline;">null</span>) {
                      PostOrderhelper(Root.right, node_list);
                  }
                  list = [context.GenerateState(), Root.data, <span style="font-style: italic;">" "</span> + Root.data + <span style="font-style: italic;">" "</span>, <span style="font-style: italic;">"red"</span>]
                  context.animationState.push(list)

                  node_list.push(Root.data);
              }
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node_list</span> = [];
          <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">list</span> = [context.GenerateState(), -999, <span style="font-style: italic;">"Post Order : [ "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)
          PostOrderhelper(<span style="font-weight: bold; text-decoration: underline;">this</span>.root, node_list);
          list = [context.GenerateState(), -999, <span style="font-style: italic;">" ] "</span>, <span style="font-style: italic;">"black"</span>]
          context.animationState.push(list)
          <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">console.log(node_list);</span>
          <span style="font-weight: bold;">return</span> node_list;
      }


      Erase() {
          <span style="font-weight: bold; text-decoration: underline;">this</span>.root = <span style="font-weight: bold; text-decoration: underline;">null</span>;
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">null</span>;
      }


      Height() {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">HeightWithRoot</span> = <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">Root</span>) {
              <span style="font-weight: bold;">if</span> (Root == <span style="font-weight: bold; text-decoration: underline;">null</span>)
                  <span style="font-weight: bold;">return</span> 0;
              <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">lHeight</span> = HeightWithRoot(Root.left);
              <span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">rHeight</span> = HeightWithRoot(Root.right);
              <span style="font-weight: bold;">if</span> (lHeight &gt; rHeight)
                  <span style="font-weight: bold;">return</span> 1 + lHeight;
              <span style="font-weight: bold;">return</span> 1 + rHeight;
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">height</span> = HeightWithRoot(<span style="font-weight: bold; text-decoration: underline;">this</span>.root);
          <span style="font-weight: bold;">return</span> height;
      }



      Level() {
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">LevelWithRoot</span> = <span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">Root</span>) {
              <span style="font-weight: bold;">if</span> (Root == <span style="font-weight: bold; text-decoration: underline;">null</span>)
                  <span style="font-weight: bold;">return</span> 0;
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">lHeight</span> = LevelWithRoot(Root.left);
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">rHeight</span> = LevelWithRoot(Root.right);
              <span style="font-weight: bold;">if</span> (lHeight &gt; rHeight)
                  <span style="font-weight: bold;">return</span> 1 + lHeight;
              <span style="font-weight: bold;">return</span> 1 + rHeight;
          }
          <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">level</span> = LevelWithRoot(<span style="font-weight: bold; text-decoration: underline;">this</span>.root);
          <span style="font-weight: bold;">return</span> level;
      }

      Search(Root, Key) {
          <span style="font-weight: bold;">if</span> (Root === <span style="font-weight: bold; text-decoration: underline;">null</span>)
              <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">null</span>;
          <span style="font-weight: bold;">if</span> (Key == Root.data)
              <span style="font-weight: bold;">return</span> Root;
          <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">this</span>.Search(Root.left, Key) || <span style="font-weight: bold; text-decoration: underline;">this</span>.Search(Root.right, Key));
      }


  };

</pre>
</div>
<p>
The details of the various methods defined in the <i>BinaryTree</i> class are as follows:
</p>
</div>
