src/tree-library.org
*** CreateNode(Value):
    The /CreateNode/ method takes the value of the node to be created as an argument. It is invoked by an object of the /Binary Tree/ class and can create a single Binary Node as a result. This method is also used by other methods like /Insert/ to build Binary Trees.

#+BEGIN_SRC js
          CreateNode(Key){
              var NewNode = new BinaryNode(Key);
              return NewNode;
          }
#+END_SRC

To create a new node the following syntax can be used:

#+BEGIN_EXAMPLE
	var newTree = new BinaryTree();
	newTree.CreateNode(10);
#+END_EXAMPLE

This creates and returns a Binary Node with node value 10 and value of both Left-child and Right-child as null.

*** Insert(Value):
    The /Insert/ method takes the value of the new node to be created as an argument, inserts a new node to the tree and returns the modified tree.
#+BEGIN_SRC js
  Insert(Value){
      var NewNode = this.CreateNode(Value);
       if(this.root===null)
            this.root = NewNode;
        else
            InsertNode(this.root,NewNode);
        return this;}
#+END_SRC

This method calls a helper function called /InsertNode/ defined in the code snippet below.

#+BEGIN_SRC js
          function InsertNode(Root,newNode){
              var Queue = [];
              Queue.push(Root); //push the root
              while(true){
                  var node = Queue.pop();
                  if(node.left === null){
                      node.left = newNode;
                      return;
                  } else {
                      Queue.unshift(node.left)
                  }

                  if(node.right === null){
                      node.right = newNode;
                  return;
                  } else {
                      Queue.unshift(node.right)
                  }
              }
          }

#+END_SRC

To insert a new node into the (previously created) Binary Tree, the following syntax is used:

#+BEGIN_EXAMPLE
  var newTree = new BinaryTree();
  newTree.Insert(5);

#+END_EXAMPLE
This creates a new Binary Node with value = 4 and inserts it as the left-child of the Binary Tree.

*** BuildTree(nodelist)
This method can be used to rapidly build a Binary Tree. It takes a list of nodes as an argument and constructs the Binary Tree from that list of nodes. It calls the /Insert/ method described as it iterates through the list to construct the tree.

#+BEGIN_SRC js
  BuildTree(NodeList=null){
      for(let node in NodeList){
          this.Insert(NodeList[node]);
      }
      return this;
  }

#+END_SRC

This method can be used as:
#+BEGIN_EXAMPLE
  newTree.BuildTree([6,8,2,9,1,3]);
#+END_EXAMPLE

This will insert in the Binary Tree all then values in the list.

*** GetRootNode():
    This simple method returns the root element i.e. the Binary Node in the root of the tree.
#+BEGIN_SRC js
      GetRootNode(){
          return this.root;
      }
#+END_SRC

Usage:
#+BEGIN_EXAMPLE
    newTree.GetRootNode();
#+END_EXAMPLE

This returns the root node of the tree (5 in this case)

*** Size():
    This method counts the total number of nodes that are present in the Binary Tree and returns that value. A helper function called /CalSize/ to count the total number of nodes starting from the root node of the tree.
#+BEGIN_SRC js
    Size(){
        var size = CalSize(this.root);
        return size;
    }

#+END_SRC
The helper function /Calsize/ is defined as:
#+BEGIN_SRC js
    var CalSize = function (Root){
        if(Root != null){
            return   1 + CalSize(Root.left)   +   CalSize(Root.right);
        }
        else{
            return 0;
        }
    }
#+END_SRC

This method can be used as:
#+BEGIN_EXAMPLE
    newTree.Size();
#+END_EXAMPLE

*** Height():
    This method calculates the height of the Binary Tree and returns that value. A helper function called /HeightWithRoot/ to calculate the height from the root node of the tree.
#+BEGIN_SRC js
  Height(){
      var height = HeightWithRoot(this.root);
      return height;
  }

#+END_SRC
The helper function /HeightWithRoot/ is defined as:
#+BEGIN_SRC js
    var HeightWithRoot = function(Root){
            if(Root == null)
                return 0;
            let lHeight = HeightWithRoot(Root.left);
            let rHeight = HeightWithRoot(Root.right);
            if(lHeight > rHeight)
                return 1 + lHeight;
            return 1 + rHeight;
    }
#+END_SRC

This method can be used as:
#+BEGIN_EXAMPLE
    newTree.Height();
#+END_EXAMPLE


*** Level():
    This method calculates the number of levels (from of the root) of the Binary Tree and returns that value. A helper function called /LevelWithRoot/ to calculate the number of levels from the root node of the tree.
#+BEGIN_SRC js
    Level(){
        var level = LevelWithRoot(this.root);
        return level;
    }

#+END_SRC
The helper function /LevelWithRoot/ is defined as:
#+BEGIN_SRC js
   var LevelWithRoot = function(Root){
       if(Root == null)
           return 0;
       var lHeight = LevelWithRoot(Root.left);
       var rHeight = LevelWithRoot(Root.right);
       if(lHeight > rHeight)
           return 1 + lHeight;
       return 1 + rHeight;
  }
#+END_SRC

This method can be used as:
#+BEGIN_EXAMPLE
    newTree.Level();
#+END_EXAMPLE

