build/docs/tree-library.html

<div id="outline-container-org5dc977c" class="outline-4">
<h4 id="org5dc977c"><span class="section-number-4">2.1.1</span> CreateNode(Value):</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The <i>CreateNode</i> method takes the value of the node to be created as an argument. It is invoked by an object of the <i>Binary Tree</i> class and can create a single Binary Node as a result. This method is also used by other methods like <i>Insert</i> to build Binary Trees.
</p>

<div class="org-src-container">
<pre class="src src-js">          CreateNode(Key){
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">NewNode</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">BinaryNode</span>(Key);
              <span style="font-weight: bold;">return</span> NewNode;
          }
</pre>
</div>

<p>
To create a new node the following syntax can be used:
</p>

<pre class="example">
	var newTree = new BinaryTree();
	newTree.CreateNode(10);
</pre>

<p>
This creates and returns a Binary Node with node value 10 and value of both Left-child and Right-child as null.
</p>
</div>
</div>

<div id="outline-container-org54200b0" class="outline-4">
<h4 id="org54200b0"><span class="section-number-4">2.1.2</span> Insert(Value):</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
The <i>Insert</i> method takes the value of the new node to be created as an argument, inserts a new node to the tree and returns the modified tree.
</p>
<div class="org-src-container">
<pre class="src src-js">  Insert(Value){
      <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">NewNode</span> = <span style="font-weight: bold; text-decoration: underline;">this</span>.CreateNode(Value);
       <span style="font-weight: bold;">if</span>(<span style="font-weight: bold; text-decoration: underline;">this</span>.root===<span style="font-weight: bold; text-decoration: underline;">null</span>)
            <span style="font-weight: bold; text-decoration: underline;">this</span>.root = NewNode;
        <span style="font-weight: bold;">else</span>
            InsertNode(<span style="font-weight: bold; text-decoration: underline;">this</span>.root,NewNode);
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>;}
</pre>
</div>

<p>
This method calls a helper function called <i>InsertNode</i> defined in the code snippet below.
</p>

<div class="org-src-container">
<pre class="src src-js">          <span style="font-weight: bold;">function</span> <span style="font-weight: bold;">InsertNode</span>(<span style="font-weight: bold; font-style: italic;">Root</span>,<span style="font-weight: bold; font-style: italic;">newNode</span>){
              <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">Queue</span> = [];
              Queue.push(Root); <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">push the root</span>
              <span style="font-weight: bold;">while</span>(<span style="font-weight: bold; text-decoration: underline;">true</span>){
                  <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span> = Queue.pop();
                  <span style="font-weight: bold;">if</span>(node.left === <span style="font-weight: bold; text-decoration: underline;">null</span>){
                      node.left = newNode;
                      <span style="font-weight: bold;">return</span>;
                  } <span style="font-weight: bold;">else</span> {
                      Queue.unshift(node.left)
                  }

                  <span style="font-weight: bold;">if</span>(node.right === <span style="font-weight: bold; text-decoration: underline;">null</span>){
                      node.right = newNode;
                  <span style="font-weight: bold;">return</span>;
                  } <span style="font-weight: bold;">else</span> {
                      Queue.unshift(node.right)
                  }
              }
          }

</pre>
</div>

<p>
To insert a new node into the (previously created) Binary Tree, the following syntax is used:
</p>

<pre class="example">
  var newTree = new BinaryTree();
  newTree.Insert(5);

</pre>
<p>
This creates a new Binary Node with value = 4 and inserts it as the left-child of the Binary Tree.
</p>
</div>
</div>

<div id="outline-container-org3d07f01" class="outline-4">
<h4 id="org3d07f01"><span class="section-number-4">2.1.3</span> BuildTree(nodelist)</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
This method can be used to rapidly build a Binary Tree. It takes a list of nodes as an argument and constructs the Binary Tree from that list of nodes. It calls the <i>Insert</i> method described as it iterates through the list to construct the tree.
</p>

<div class="org-src-container">
<pre class="src src-js">  BuildTree(NodeList=<span style="font-weight: bold; text-decoration: underline;">null</span>){
      <span style="font-weight: bold;">for</span>(<span style="font-weight: bold;">let</span> <span style="font-weight: bold; font-style: italic;">node</span> <span style="font-weight: bold;">in</span> NodeList){
          <span style="font-weight: bold; text-decoration: underline;">this</span>.Insert(NodeList[node]);
      }
      <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>;
  }

</pre>
</div>

<p>
This method can be used as:
</p>
<pre class="example">
  newTree.BuildTree([6,8,2,9,1,3]);
</pre>

<p>
This will insert in the Binary Tree all then values in the list.
</p>
</div>
</div>

<div id="outline-container-org514aef5" class="outline-4">
<h4 id="org514aef5"><span class="section-number-4">2.1.4</span> GetRootNode():</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
This simple method returns the root element i.e. the Binary Node in the root of the tree.
</p>
<div class="org-src-container">
<pre class="src src-js">      GetRootNode(){
          <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">this</span>.root;
      }
</pre>
</div>

<p>
Usage:
</p>
<pre class="example">
    newTree.GetRootNode();
</pre>

<p>
This returns the root node of the tree (5 in this case)
</p>
</div>
</div>

<div id="outline-container-org4700ca9" class="outline-4">
<h4 id="org4700ca9"><span class="section-number-4">2.1.5</span> Size():</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
This method counts the total number of nodes that are present in the Binary Tree and returns that value. A helper function called <i>CalSize</i> to count the total number of nodes starting from the root node of the tree.
</p>
<div class="org-src-container">
<pre class="src src-js">    Size(){
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">size</span> = CalSize(<span style="font-weight: bold; text-decoration: underline;">this</span>.root);
        <span style="font-weight: bold;">return</span> size;
    }

</pre>
</div>
<p>
The helper function <i>Calsize</i> is defined as:
</p>
<div class="org-src-container">
<pre class="src src-js">    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">CalSize</span> = <span style="font-weight: bold;">function</span> (<span style="font-weight: bold; font-style: italic;">Root</span>){
        <span style="font-weight: bold;">if</span>(Root != <span style="font-weight: bold; text-decoration: underline;">null</span>){
            <span style="font-weight: bold;">return</span>   1 + CalSize(Root.left)   +   CalSize(Root.right);
        }
        <span style="font-weight: bold;">else</span>{
            <span style="font-weight: bold;">return</span> 0;
        }
    }
</pre>
</div>

<p>
This method can be used as:
</p>
<pre class="example">
    newTree.Size();
</pre>
</div>
</div>
