src/tree-library.org
*** Insert(Value):
    This method is used to create a new Binary Node and insert into the existing Binary Search Tree or if no nodes exist in the tree, it designated the newly created node as the root of the tree. It overrides the /Insert/ method of the /BinaryTree/ class. The method internally call a helper function /InsertNode/ to insert the newly created node in the tree. The method can be used as:

#+BEGIN_EXAMPLE
	bst.Insert(5);
#+END_EXAMPLE
 
*** BuildTree(Nodelist):
    This method can be used to rapidly build a Binary Search Tree. It takes a list of nodes as an argument and constructs the Binary Tree from that list of nodes. It overrides the /BuildTree/ method of the /BinaryTree/ class. It calls the /Insert/ method described as it iterates through the list to construct the tree. The method can be used as:

#+BEGIN_EXAMPLE
	bst.BuildTree([4,6,8,9,7,2,1,3]);
#+END_EXAMPLE

*** Remove(Value):
    This method is used to remove a particular node from the Binary Search Tree. It takes the value of the node to be removed as an argument. This method overrides the /Remove/ method of the /BinaryTree/ class. It internally calls the helper function /RemoveNode/. It can be used as:

#+BEGIN_EXAMPLE
	bst.Remove(8);
#+END_EXAMPLE

*** CopyTree(node):
    This method is used to create a copy of the Binary Search Tree and return the created copy (which can then be assigned to another object of type Binary Search Tree) starting from the node given as a parameter (default parameter is root of tree). It internally calls the /CopyNode/ method of the /BinaryTree/ tree. It can be used as:

#+BEGIN_EXAMPLE
	var bst2 = new BinarySearchTree();   //create new object of BinarySearchTree class
	bst2 = bst.CopyTree();
	//To copy the left subtree from root
	bst2 = bst.CopyTree(root.left);
#+END_EXAMPLE

*** Search(Value):
    Using this method it is possible to search for a value given as parameter in the Binary Search Tree. If the node having value as the one given given as a parameter exists, it is returned, else a 'Node not found' message is returned. It internally calls a helper function /SearchFactory/. This method overrides the /Search/ method defined in /BinaryTree/ class. It can be used as:

#+BEGIN_EXAMPLE
	bst.Search(6);
#+END_EXAMPLE
    

*** FindMinimum():
	This method returns the minimum valued node in the Binary Search Tree. It internally calls the /FindMinNode/ helper function. It can be used as:

#+BEGIN_EXAMPLE
	bst.FindMinimum();
#+END_EXAMPLE

*** RightSubtree():
    This method return the right subtree of the Binary Search Tree. It internally calls the /CopyTree/ method. Since a Binary Search Tree is returned, it can be assigned to another object of /BinarySearchTree/ class. It can be used as:

#+BEGIN_EXAMPLE
	bst2 = new BinarySearchTree();
	bst2 = bst.RightSubtree();
#+END_EXAMPLE

*** LeftSubtree():
     This method return the left subtree of the Binary Search Tree. It internally calls the /CopyTree/ method. Since a Binary Search Tree is returned, it can be assigned to another object of /BinarySearchTree/ class. It can be used as:

#+BEGIN_EXAMPLE
	bst2 = new BinarySearchTree();
	bst2 = bst.LeftSubtree();
#+END_EXAMPLE

*** GenerateState():
    This method is for internal usage to generate the state of the Binary Search Tree that is later used by the renderer and subsequently by the user application.

** COMMENT AVL Tree Class
#+NAME: AVL_Tree_Class
#+BEGIN_SRC js :exports none :eval never-export

///////////////////////////////////////////////////////////////////////////////////

// The following code provides the developer with the basic functions on AVL Trees (through developer console) //
// It has not yet been interfaced with the renderer and presently not available for use by the end-user //

///////////////////////////////////////////////////////////////////////////////////

class AVLNode extends BinaryNode
{
  constructor(data = null,left_child = null,right_child = null){
      super(data,left_child,right_child);
      this.height=0;

  }
};

class AVLTree extends BinarySearchTree{

// A utility function to get the height of the tree
height(N)
{
    if (N === null)
        return 0;
    return N.height;
}

// A utility function to get maximum of two integers
max(a,b)
{
    if(a>b)
    {
      return a;
    }
    return b;
}

/* Helper function that allocates a new node with the given data and
    NULL left and right pointers. */
newNode(data)
{
    var node = new AVLNode();
    node.data   = data;
    node.height = 1;  // new node is initially added at leaf
    return node;
}

// A utility function to right rotate subtree rooted with y
// See the diagram given above.
rightRotate(y)
{
    var x = y.left;
    var T2 = x.right;

    // Perform rotation
    x.right = y;
    y.left = T2;

    // Update heights
    y.height = this.max(this.height(y.left), this.height(y.right))+1;
    x.height = this.max(this.height(x.left), this.height(x.right))+1;

    // Return new root
    return x;
}

// A utility function to left rotate subtree rooted with x
// See the diagram given above.
leftRotate(x)
{
  var  y = x.right;
  var  T2 = y.left;

    // Perform rotation
    y.left = x;
    x.right = T2;

    //  Update heights
    x.height = this.max(this.height(x.left), this.height(x.right))+1;
    y.height = this.max(this.height(y.left), this.height(y.right))+1;

    // Return new root
    return y;
}

// Get Balance factor of node N
getBalance(N)
{
    if (N === null)
        return 0;
    return this.height(N.left) - this.height(N.right);
}
Insert(data){

this.root =   this.inserthelper(this.root,data);
}
// Recursive function to insert a data in the subtree rooted
// with node and returns the new root of the subtree.
inserthelper(node,data)
{
    /* 1.  Perform the normal BST insertion */
    if (node === null)
        return(this.newNode(data));

    if (data < node.data)
        node.left  = this.inserthelper(node.left, data);
    else if (data > node.data)
        node.right = this.inserthelper(node.right, data);
    else // Equal datas are not allowed in BST
        return node;

    /* 2. Update height of this ancestor node */
    node.height = 1 + this.max(this.height(node.left),
                           this.height(node.right));

    /* 3. Get the balance factor of this ancestor
          node to check whether this node became
          unbalanced */
  var  balance = this.getBalance(node);

    // If this node becomes unbalanced, then
    // there are 4 cases

    // Left Left Case
    if (balance > 1 && data < node.left.data)
        return this.rightRotate(node);

    // Right Right Case
    if (balance < -1 && data > node.right.data)
        return this.leftRotate(node);

    // Left Right Case
    if (balance > 1 && data > node.left.data)
    {
        node.left =  this.leftRotate(node.left);
        return this.rightRotate(node);
    }

    // Right Left Case
    if (balance < -1 && data < node.right.data)
    {
        node.right = rightRotate(node.right);
        return this.leftRotate(node);
    }

    /* return the (unchanged) node pointer */
    return node;
}
minValueNode(node)
{
var current = node;

    /* loop down to find the leftmost leaf */
    while (current.left != null)
        current = current.left;

    return current;
}

// Recursive function to delete a node with given data
// from subtree with given root. It returns root of
// the modified subtree.
Delete(data){
  this.root = this.deleteNode(this.root,data);
}
deleteNode(root,data)
{
    // STEP 1: PERFORM STANDARD BST DELETE

    if (root ===null)
        return root;

    // If the data to be deleted is smaller than the
    // root's data, then it lies in left subtree
    if ( data < root.data )
        root.left = this.deleteNode(root.left, data);

    // If the data to be deleted is greater than the
    // root's data, then it lies in right subtree
    else if( data > root.data )
        root.right = this.deleteNode(root.right, data);

    // if data is same as root's data, then This is
    // the node to be deleted
    else
    {
        // node with only one child or no child
        if( (root.left === null) || (root.right === null) )
        {
            var temp = root.left ? root.left : root.right;

            // No child case
            if (temp === null)
            {
                temp = root;
                root = null;
            }
            else // One child case
              root = temp; // Copy the contents of
                            // the non-empty child

        }
        else
        {
            // node with two children: Get the inorder
            // successor (smallest in the right subtree)
            temp = this.minValueNode(root.right);

            // Copy the inorder successor's data to this node
            root.data = temp.data;

            // Delete the inorder successor
            root.right = this.deleteNode(root.right, temp.data);
        }
    }

    // If the tree had only one node then return
    if (root === null)
      return root;

    // STEP 2: UPDATE HEIGHT OF THE CURRENT NODE
    root.height = 1 + this.max(this.height(root.left),
                           this.height(root.right));

    // STEP 3: GET THE BALANCE FACTOR OF THIS NODE (to
    // check whether this node became unbalanced)
    var balance = this.getBalance(root);

    // If this node becomes unbalanced, then there are 4 cases

    // Left Left Case
    if (balance > 1 && this.getBalance(root.left) >= 0)
        return this.rightRotate(root);

    // Left Right Case
    if (balance > 1 && this.getBalance(root.left) < 0)
    {
        root.left =  this.leftRotate(root.left);
        return this.rightRotate(root);
    }

    // Right Right Case
    if (balance < -1 && this.getBalance(root.right) <= 0)
        return this.leftRotate(root);

    // Right Left Case
    if (balance < -1 && this.getBalance(root.right) > 0)
    {
        root.right = this.rightRotate(root.right);
        return this.leftRotate(root);
    }

    return root;
}


};

#+END_SRC

