build/docs/tree-library.html

<div id="outline-container-orgaab19e7" class="outline-4">
<h4 id="orgaab19e7"><span class="section-number-4">2.2.1</span> Insert(Value):</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
This method is used to create a new Binary Node and insert into the existing Binary Search Tree or if no nodes exist in the tree, it designated the newly created node as the root of the tree. It overrides the <i>Insert</i> method of the <i>BinaryTree</i> class. The method internally call a helper function <i>InsertNode</i> to insert the newly created node in the tree. The method can be used as:
</p>

<pre class="example">
	bst.Insert(5);
</pre>
</div>
</div>

<div id="outline-container-org5ae6fac" class="outline-4">
<h4 id="org5ae6fac"><span class="section-number-4">2.2.2</span> BuildTree(Nodelist):</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
This method can be used to rapidly build a Binary Search Tree. It takes a list of nodes as an argument and constructs the Binary Tree from that list of nodes. It overrides the <i>BuildTree</i> method of the <i>BinaryTree</i> class. It calls the <i>Insert</i> method described as it iterates through the list to construct the tree. The method can be used as:
</p>

<pre class="example">
	bst.BuildTree([4,6,8,9,7,2,1,3]);
</pre>
</div>
</div>

<div id="outline-container-org1053c8d" class="outline-4">
<h4 id="org1053c8d"><span class="section-number-4">2.2.3</span> Remove(Value):</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This method is used to remove a particular node from the Binary Search Tree. It takes the value of the node to be removed as an argument. This method overrides the <i>Remove</i> method of the <i>BinaryTree</i> class. It internally calls the helper function <i>RemoveNode</i>. It can be used as:
</p>

<pre class="example">
	bst.Remove(8);
</pre>
</div>
</div>

<div id="outline-container-org278fa82" class="outline-4">
<h4 id="org278fa82"><span class="section-number-4">2.2.4</span> CopyTree(node):</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
This method is used to create a copy of the Binary Search Tree and return the created copy (which can then be assigned to another object of type Binary Search Tree) starting from the node given as a parameter (default parameter is root of tree). It internally calls the <i>CopyNode</i> method of the <i>BinaryTree</i> tree. It can be used as:
</p>

<pre class="example">
	var bst2 = new BinarySearchTree();   //create new object of BinarySearchTree class
	bst2 = bst.CopyTree();
	//To copy the left subtree from root
	bst2 = bst.CopyTree(root.left);
</pre>
</div>
</div>

<div id="outline-container-org36c4979" class="outline-4">
<h4 id="org36c4979"><span class="section-number-4">2.2.5</span> Search(Value):</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Using this method it is possible to search for a value given as parameter in the Binary Search Tree. If the node having value as the one given given as a parameter exists, it is returned, else a 'Node not found' message is returned. It internally calls a helper function <i>SearchFactory</i>. This method overrides the <i>Search</i> method defined in <i>BinaryTree</i> class. It can be used as:
</p>

<pre class="example">
	bst.Search(6);
</pre>
</div>
</div>


<div id="outline-container-org2f99dd8" class="outline-4">
<h4 id="org2f99dd8"><span class="section-number-4">2.2.6</span> FindMinimum():</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
This method returns the minimum valued node in the Binary Search Tree. It internally calls the <i>FindMinNode</i> helper function. It can be used as:
</p>

<pre class="example">
	bst.FindMinimum();
</pre>
</div>
</div>

<div id="outline-container-org786e42b" class="outline-4">
<h4 id="org786e42b"><span class="section-number-4">2.2.7</span> RightSubtree():</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
This method return the right subtree of the Binary Search Tree. It internally calls the <i>CopyTree</i> method. Since a Binary Search Tree is returned, it can be assigned to another object of <i>BinarySearchTree</i> class. It can be used as:
</p>

<pre class="example">
	bst2 = new BinarySearchTree();
	bst2 = bst.RightSubtree();
</pre>
</div>
</div>

<div id="outline-container-org8e1fa65" class="outline-4">
<h4 id="org8e1fa65"><span class="section-number-4">2.2.8</span> LeftSubtree():</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
This method return the left subtree of the Binary Search Tree. It internally calls the <i>CopyTree</i> method. Since a Binary Search Tree is returned, it can be assigned to another object of <i>BinarySearchTree</i> class. It can be used as:
</p>

<pre class="example">
	bst2 = new BinarySearchTree();
	bst2 = bst.LeftSubtree();
</pre>
</div>
</div>

<div id="outline-container-org68529ae" class="outline-4">
<h4 id="org68529ae"><span class="section-number-4">2.2.9</span> GenerateState():</h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
This method is for internal usage to generate the state of the Binary Search Tree that is later used by the renderer and subsequently by the user application.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgab0641f" class="outline-2">
<h2 id="orgab0641f"><span class="section-number-2">3</span> Tangle</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-js">&lt;&lt;Binary_Node_Class&gt;&gt;
&lt;&lt;Binary_Tree_Class&gt;&gt;
&lt;&lt;Binary_Search_Tree_Class&gt;&gt;
&lt;&lt;AVL_Tree_Class&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ankit Pant, Danish Mukhtar, Giridhari Lal Gupta (APS Team) VLEAD</p>
<p class="date">Created: 2018-11-11 Sun 22:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
